wangxiufeng1104/stm32f769-diso-UART/Core/Src/main.cpp
/* Graphic application */  
  GRAPHICS_MainTask();

  /* USER CODE BEGIN 5 */
    /* Infinite loop */
    for (;;)
    {
        osDelay(1);
    }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_ledStartEntry */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_ledStartEntry */
void ledStartEntry(void const * argument)
{
  /* USER CODE BEGIN ledStartEntry */
  /* Infinite loop */
  osEvent retkey;
  for(;;)
  {
    retkey.value.v = 0;
    retkey = osMessageGet(led_msgHandle,10);
    if(retkey.value.v == UBP_GREENLIGHT_TOGGLE)
    {
        HAL_GPIO_TogglePin(LD_USER2_GPIO_Port,LD_USER2_Pin);
    }
    else if(retkey.value.v == UBP_REDLIGHT_TOGGLE)
    {
      HAL_GPIO_TogglePin(LD_USER1_GPIO_Port,LD_USER1_Pin);
    }
    //osDelay(1000);
  }
  /* USER CODE END ledStartEntry */
}

/* USER CODE BEGIN Header_startModbusEntry */
/**
* @brief Function implementing the ModbusTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startModbusEntry */
void startModbusEntry(void const * argument)
{
  /* USER CODE BEGIN startModbusEntry */
  /* Infinite loop */
  for(;;)
  {
    //_dbg_printf("hello world\n");
    osDelay(100);
  }
  /* USER CODE END startModbusEntry */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
